var provice = [
    {name: "北京市",city: [{name: "北京市",districtAndCounty: ["北京市","东城区","西城区","朝阳区","丰台区","石景山区","海淀区","门头沟区","房山区","通州区","顺义区","昌平区","大兴区","怀柔区","平谷区","密云区","延庆区"]}]},
    {name: "天津市",city: [{name: "天津市",districtAndCounty: ["天津市","和平区","河东区","河西区","南开区","河北区","红桥区","东丽区","西青区","津南区","北辰区","武清区","宝坻区","滨海新区","宁河区","静海区","蓟州区"]}]},
    {name: "上海市",city: [{name: "上海市",districtAndCounty: ["上海市","黄浦区","徐汇区","长宁区","静安区","普陀区","虹口区","杨浦区","闵行区","宝山区","嘉定区","浦东新区","金山区","松江区","青浦区","奉贤区","崇明区"]}]},
    {name: "重庆市",city: [{name: "重庆市",districtAndCounty: ["重庆市","万州","涪陵","渝中","大渡口","江北","沙坪坝","九龙坡","南岸","北碚","綦江","大足","渝北","巴南","黔江","长寿","江津","合川","永川","南川","璧山","铜梁","潼南","荣昌","开州","梁平","武隆","城口","丰都","垫江","忠县","云阳","奉节","巫山","巫溪","石柱","秀山","酉阳","彭水"]}]},
    {
        name: "河北省",
        city: [
            {name: "石家庄",districtAndCounty: ["石家庄","长安区","桥区西","新华区","井陉矿区","裕华","藁城","鹿泉","栾城","井陉","正定","行唐","灵寿","高邑","深泽","赞皇","无极","平山","元氏","赵县","辛集","晋州","新乐"]},
            {name: "张家口",districtAndCounty: ["张家口","桥西区","桥东区","宣化区","下花园区","万全县","崇礼县","张北县","康保县","沽源县","尚义县","蔚县","阳原县","怀安县","怀来县","涿鹿县","赤城县"]},
            {name: "承德市",districtAndCounty: ["承德市","双桥区","双滦区","鹰手营子矿","承德县","兴隆县","滦平县","隆化","丰宁","宽城","围场","平泉县"]},
            {name: "秦皇岛",districtAndCounty: ["秦皇岛","海港区","山海关","北戴河","抚宁","青龙","昌黎","卢龙"]},
            {name: "唐山市",districtAndCounty: ["唐山市","路北区","路南区","古冶区","开平区","丰润区","丰南区","曹妃甸","滦南","乐亭","迁西","玉田","遵化","迁安", "滦州"]},
            {name: "廊坊市",districtAndCounty: ["廊坊市","安次区","广阳区","固安县","永清县","香河县","大城县","文安县","大厂回族自治县","霸州市","三河市"]},
            {name: "保定市",districtAndCounty: ["保定市","竞秀","莲池","满城","清苑县","徐水县","涞水县","阜平县","定兴县","唐县","高阳县","容城县","涞源县","望都县","安新县","易县","曲阳县","蠡县","顺平县","博野县","雄县","涿州市","定州市","安国","高碑店"]},
            {name: "衡水市",districtAndCounty: ["衡水市","桃城区","冀州市","枣强县","武邑县","武强县","饶阳县","安平县","故城县","景县","阜城县","深州市"]},
            {name: "沧州市",districtAndCounty: ["沧州市","新华区","运河区","沧县","青县","东光县","海兴县","盐山县","肃宁县","南皮县","吴桥县","献县","孟村","泊头市","任丘市","黄骅市","河间市"]},
            {name: "邢台市",districtAndCounty: ["邢台市","桥东区","桥西区","邢台县","临城县","内丘县","柏乡县","隆尧县","任县","南和县","宁晋县","巨鹿县","新河县","广宗县","平乡县","威县","清河县","临西县","南宫市","沙河市"]},
            {name: "邯郸市",districtAndCounty: ["邯郸市","邯山区","丛台区","复兴区","峰峰矿区","肥乡","永年","临漳","成安","大名","涉县","磁县","邱县","鸡泽","广平","馆陶","魏县","曲周","武安"]}
        ]
    },
    {
        name: "山西省",
        city: [
            {name: "太原市",districtAndCounty: ["太原市","小店","迎泽","杏花岭","尖草坪","万柏林","晋源","清徐","阳曲","娄烦","古交"]},
            {name: "朔州市",districtAndCounty: ["朔州市","朔城区","平鲁区","山阴县","应县","右玉县","怀仁县"]},
            {name: "大同市",districtAndCounty: ["大同市","新荣区","南郊区","浑源县","阳高县","云冈","灵丘县","左云县","广灵县","天镇县","云州"]},
            {name: "阳泉市",districtAndCounty: ["阳泉市","矿区","郊区","平定县","盂县"]},
            {name: "长治市",districtAndCounty: ["长治市","潞州","屯留县","潞城市","襄垣县","平顺县","黎城县","壶关县","长子县","武乡县","沁县","沁源县"]},
            {name: "晋城市",districtAndCounty: ["晋城市","沁水县","阳城县","陵川县","泽州县","高平市"]},
            {name: "忻州市",districtAndCounty: ["忻州市","忻府区","定襄县","五台县","代县","繁峙县","宁武县","静乐县","神池县","五寨县","岢岚县","河曲县","保德县","偏关县","原平市"]},
            {name: "晋中市",districtAndCounty: ["晋中市","榆次区","榆社县","左权县","和顺县","昔阳县","寿阳县","太谷县","祁县","平遥县","灵石县","介休市"]},
            {name: "临汾市",districtAndCounty: ["临汾市","尧都区","曲沃县","翼城县","襄汾县","洪洞县","古县","安泽县","浮山县","吉县","乡宁县","大宁县","隰县","永和县","蒲县","汾西县","侯马市","霍州市"]},
            {name: "吕梁市",districtAndCounty: ["吕梁市","离石区","文水县","交城县","兴县","临县","柳林县","石楼县","岚县","方山县","中阳县","交口县","孝义市","汾阳市"]},
            {name: "运城市",districtAndCounty: ["运城市","盐湖区","临猗县","万荣县","闻喜县","稷山县","新绛县","绛县","垣曲县","夏县","平陆县","芮城县","永济市","河津市"]}
        ]
    },
    {
        name: "内蒙古",
        city: [
            {name: "呼和浩特",districtAndCounty: ["呼和浩特市","新城区","回民区","玉泉区","赛罕区","土左旗", "托克托","和林格尔","清水河县","武川县"]},
            {name: "包头市",districtAndCounty: ["包头市","东河区","昆都仑区","青山区","石拐区","白云鄂博","九原区","土右旗","固阳县","达茂旗"]},
            {name: "乌海市",districtAndCounty: ["乌海市","海勃湾区","海南区","乌达区"]},
            {name: "赤峰市",districtAndCounty: ["赤峰市","红山区","元宝山区","松山区","阿鲁旗","巴林左旗","巴林右旗","林西县","克什克腾旗","翁牛特旗","喀喇沁旗","宁城县","敖汉旗"]},
            {name: "通辽市",districtAndCounty: ["通辽市","科尔沁","科左中旗","科左后旗","开鲁县","库伦旗","奈曼旗","扎鲁特旗","霍林郭勒"]},
            {name: "呼伦贝尔",districtAndCounty: ["呼伦贝尔","海拉尔","扎赉诺尔","阿荣旗","莫力达瓦","鄂伦春旗","鄂温克旗","陈旗","新左旗","新右旗","满洲里市","牙克石市","扎兰屯市","额尔古纳","根河市"]},
            {name: "鄂尔多斯",districtAndCounty: ["鄂尔多斯","东胜区","康巴什","达拉特旗","准格尔旗","鄂前旗","鄂托克旗","杭锦旗","乌审旗","伊金霍洛旗"]},
            {name: "乌兰察布",districtAndCounty: ["乌兰察布","集宁区","卓资县","化德县","商都县","兴和县","凉城县","察右前旗","察右中旗","察右后旗","四子王旗","丰镇市"]},
            {name: "巴彦淖尔",districtAndCounty: ["巴彦淖尔","临河区", "五原县","磴口县","乌前旗","乌中旗","乌后旗","杭锦后旗"]},
            {name: "兴安盟",districtAndCounty: ["兴安盟","乌兰浩特","阿尔山","科右前旗","科右中旗","扎赉特旗","突泉县"]},
            {name: "锡林郭勒盟",districtAndCounty: ["锡林郭勒盟","锡林浩特","二连浩特","阿巴嘎旗","苏左旗","苏右旗","东乌旗","西乌旗","太仆寺旗","镶黄旗","正镶白旗","正蓝旗","多伦县"]},
            {name: "阿拉善盟",districtAndCounty: ["阿拉善盟","阿左旗","阿右旗","额济纳旗"]}
        ]
    },
    {
        name: "辽宁省",
        city: [
            {name: "沈阳市",districtAndCounty: ["沈阳市","和平区","沈河区","大东区","皇姑区","铁西区","苏家屯","浑南","沈北新区","于洪区","辽中区","康平县","法库县","新民市"]},
            {name: "朝阳市",districtAndCounty: ["朝阳市","双塔区","龙城区","朝阳县","建平县","喀左县","北票市","凌源市"]},
            {name: "阜新市",districtAndCounty: ["阜新市","海州区","新邱区","太平区","清河门区","细河区","阜新县","彰武县"]},
            {name: "铁岭市",districtAndCounty: ["铁岭市","银州区","清河区","铁岭县","西丰县","昌图县","调兵山市","开原市"]},
            {name: "抚顺市",districtAndCounty: ["抚顺市","顺城区","新抚区","东洲区","望花区","抚顺县","新宾县","清原县"]},
            {name: "本溪市",districtAndCounty: ["本溪市","平山区","溪湖区","明山区","南芬区","本溪县","桓仁县"]},
            {name: "辽阳市",districtAndCounty: ["辽阳市","白塔区","文圣区","宏伟区","弓长岭区","太子河区","灯塔市","辽阳县"]},
            {name: "鞍山市",districtAndCounty: ["鞍山市","铁东区","铁西区","立山区","千山区","台安县","岫岩县","海城市"]},
            {name: "丹东市",districtAndCounty: ["丹东市","振兴区","元宝区","振安区","凤城市","东港市","宽甸县"]},
            {name: "大连市",districtAndCounty: ["大连市","中山区","西岗区","沙河口","甘井子","旅顺", "金州区","普兰店","长海县","瓦房店","庄河市"]},
            {name: "营口市",districtAndCounty: ["营口市","站前区","西市区","鲅鱼圈区","老边区","大石桥市","盖州市"]},
            {name: "盘锦市",districtAndCounty: ["盘锦市","兴隆台区","双台子区","大洼县","盘山县"]},
            {name: "锦州市",districtAndCounty: ["锦州市","太和区","古塔区","凌河区","黑山县","义县","凌海市","北镇市"]},
            {name: "葫芦岛市",districtAndCounty: ["葫芦岛市","龙港区","连山区","南票区","绥中县","建昌县","兴城市"]}
        ]
    },
    {
        name: "吉林省",
        city: [
            {name: "长春市",districtAndCounty: ["长春市","朝阳区","南关区","宽城区","二道区","绿园区","双阳区","九台市","榆树市","农安县","德惠市"]},
            {name: "白城市",districtAndCounty: ["白城市","洮北区","洮南市","大安市","镇赉县","通榆县"]},
            {name: "松原市",districtAndCounty: ["松原市","宁江区","前郭县","长岭县","乾安县","扶余县"]},
            {name: "吉林市",districtAndCounty: ["吉林市","船营区","龙潭区","昌邑区","丰满区","永吉县","蛟河市","桦甸市","舒兰市","磐石市"]},
            {name: "四平市",districtAndCounty: ["四平市","铁西区","铁东区","梨树县","伊通县","双辽市","公主岭"]},
            {name: "辽源市",districtAndCounty: ["辽源市","龙山区","西安区","东丰县","东辽县"]},
            {name: "通化市",districtAndCounty: ["通化市","东昌区","二道江区","通化县","辉南县","柳河县","梅河口市","集安市"]},
            {name: "白山市",districtAndCounty: ["白山市","浑江区","江源区","抚松县","靖宇县","长白县","临江市"]},
            {name: "延边州",districtAndCounty: ["延边州","延吉市","图们市","敦化市","珲春市","龙井市","和龙市","汪清县","安图县"]}
        ]
    },
    {
        name: "黑龙江省",
        city: [
            {name: "哈尔滨市",districtAndCounty: ["哈尔滨市","道里区","南岗区","道外区","平房区","松北区","香坊区","呼兰区","阿城区","双城区","依兰县","方正县","宾县","巴彦县","木兰县","通河县","延寿县","尚志市","五常市"]},
            {name: "齐齐哈尔",districtAndCounty: ["齐齐哈尔","建华区","龙沙区","铁锋区","昂昂溪","富拉尔基","碾子山","梅里斯","龙江县","依安县","泰来县","甘南县","富裕县","克山县","克东县","拜泉县","讷河市"]},
            {name: "七台河市",districtAndCounty: ["七台河","桃山区","新兴区","茄子河","勃利县"]},
            {name: "黑河市",districtAndCounty: ["黑河市","爱辉区","嫩江县","逊克县","孙吴县","北安市", "五大连池"]},
            {name: "大庆市",districtAndCounty: ["大庆市","萨尔图","龙凤区","让胡路","大同区","红岗区","肇州县","肇源县","林甸县","杜尔伯特"]},
            {name: "鹤岗市",districtAndCounty: ["鹤岗市","向阳区","工农区","南山区","兴安区","东山区","兴山区","萝北县","绥滨县"]},
            {name: "伊春市",districtAndCounty: ["伊春市","南岔区","友好区","西林区","翠峦区","新青区","美溪区","金山屯", "五营区","乌马河","汤旺河","带岭区","乌伊岭","红星区","上甘岭","铁力市","嘉荫县"]},
            {name: "佳木斯市",districtAndCounty: ["佳木斯市","前进区","向阳区","东风区","郊区","桦南县","桦川县","汤原县","同江市","富锦市","抚远县"]},
            {name: "双鸭山",districtAndCounty: ["双鸭山","尖山区","岭东区","四方台","宝山区","集贤县","友谊县","宝清县","饶河县"]},
            {name: "鸡西市",districtAndCounty: ["鸡西市","鸡冠区","恒山区","滴道区","梨树区","城子河区","麻山区","虎林市","密山市","鸡东县"]},
            {name: "牡丹江市",districtAndCounty: ["牡丹江市","爱民区","东安区","阳明区","西安区","林口县","绥芬河","海林市","宁安市","穆棱市","东宁县"]},
            {name: "绥化市",districtAndCounty: ["绥化市","北林区","望奎县","兰西县","青冈县","庆安县","明水县","绥棱县","安达市","肇东市","海伦市"]},
            {name: "大兴安岭",districtAndCounty: ["大兴安岭","呼中区","新林区","漠河县","呼玛县","塔河县", "加格达奇"]}
        ]
    },
    {
        name: "江苏省",
        city: [
            {name: "南京市",districtAndCounty: ["南京市","玄武区","秦淮区","建邺区","鼓楼区","浦口区","栖霞区","雨花台区","江宁区","六合区","溧水县","高淳县"]},
            {name: "徐州市",districtAndCounty: ["徐州市","鼓楼区","云龙区","贾汪区","泉山区","铜山县","丰县","沛县","睢宁县","邳州市","新沂市"]},
            {name: "连云港",districtAndCounty: ["连云港市","连云区","海州区","赣榆县","东海县","灌云县","灌南县"]},
            {name: "宿迁市",districtAndCounty: ["宿迁市","宿城区","宿豫区","沭阳县","泗阳县","泗洪县"]},
            {name: "淮安市",districtAndCounty: ["淮安区","淮阴区","清江浦","洪泽区","涟水县","金湖县","盱眙县"]},
            {name: "盐城市",districtAndCounty: ["盐城市","亭湖区","盐都区","大丰区","响水县","滨海县","阜宁县","射阳县","建湖县","东台市"]},
            {name: "扬州市",districtAndCounty: ["扬州市","广陵区","邗江区","江都区","宝应县","仪征市","高邮市"]},
            {name: "泰州市",districtAndCounty: ["泰州市","海陵区","高港区","靖江市","泰兴市","姜堰市","兴化市"]},
            {name: "南通市",districtAndCounty: ["南通市","崇川区","港闸区","通州区","如东县","启东市","如皋市","海门市","海安县"]},
            {name: "镇江市",districtAndCounty: ["镇江市","京口区","润州区","丹徒区","扬中市","丹阳市","句容市"]},
            {name: "常州市",districtAndCounty: ["常州市","钟楼区","天宁区","新北区", "武进区", "金坛市", "溧阳市"]},
            {name: "无锡市",districtAndCounty: ["无锡市","锡山区","惠山区","滨湖区","梁溪区","新吴区","江阴市", "宜兴市"]},
            {name: "苏州市",districtAndCounty: ["苏州市","虎丘区","吴中区","相城区","姑苏","吴江","昆山市","太仓市","常熟市","张家港市"]}
        ]
    },
    {
        name: "浙江省",
        city: [
            {name: "杭州市",districtAndCounty: ["杭州市","拱墅区","上城区","下城区","江干区","西湖区","滨江区","余杭区","萧山区","临安市","富阳市","建德市","桐庐县","淳安县"]},
            {name: "湖州市",districtAndCounty: ["湖州市","吴兴区","南浔区","德清县","长兴县","安吉县"]},
            {name: "嘉兴市",districtAndCounty: ["嘉兴市","南湖区","秀洲区","嘉善县","海盐县","海宁市","平湖市","桐乡市"]},
            {name: "舟山市",districtAndCounty: ["舟山市","定海区","普陀区","岱山县","嵊泗县"]},
            {name: "宁波市",districtAndCounty: ["宁波市","海曙区","江北区","北仑区","镇海区","鄞州区","奉化市","慈溪市", "余姚市","宁海县", "象山县"]},
            {name: "绍兴市",districtAndCounty: ["绍兴市","越城区","柯桥区","上虞市","嵊州市","诸暨市","新昌县"]},
            {name: "衢州市",districtAndCounty: ["衢州市","柯城区","衢江区","江山市","常山县","开化县","龙游县"]},
            {name: "金华市",districtAndCounty: ["金华市","婺城区","金东区","武义县","浦江县","磐安县","兰溪市","义乌市","东阳市","永康市"]},
            {name: "台州市",districtAndCounty: ["台州市","椒江区","黄岩区","路桥区","三门县","天台县","仙居县","温岭市","临海市","玉环县"]},
            {name: "温州市",districtAndCounty: ["温州市","鹿城区","龙湾区","瓯海区","洞头县","永嘉县","平阳县","苍南县","文成县","泰顺县","瑞安市","乐清市"]},
            {name: "丽水市",districtAndCounty: ["丽水市","莲都区","青田县","缙云县","遂昌县","松阳县","云和县","庆元县","景宁县","龙泉市"]}
        ]
    },
    {
        name: "安徽省",
        city: [
            {name: "合肥市",districtAndCounty: ["合肥市","瑶海区","庐阳区","蜀山区","包河区","长丰","肥东","肥西", "庐江","巢湖"]},
            {name: "宿州市",districtAndCounty: ["宿州市","埇桥区","砀山县","萧县","灵璧县","泗县"]},
            {name: "淮北市",districtAndCounty: ["淮北市","相山区","杜集区","烈山区","濉溪县"]},
            {name: "亳州市",districtAndCounty: ["亳州市","谯城区","涡阳县","蒙城县","利辛县"]},
            {name: "阜阳市",districtAndCounty: ["阜阳市","颍州区","颍东区","颍泉区","临泉县","太和县","阜南县","颍上县","界首市"]},
            {name: "蚌埠市",districtAndCounty: ["蚌埠市","蚌山区","龙子湖区","禹会区","淮上区","怀远县","五河县","固镇县"]},
            {name: "淮南市",districtAndCounty: ["淮南市","大通区","田家庵区","谢家集区","八公山区","潘集区","凤台县","寿县"]},
            {name: "滁州市",districtAndCounty: ["滁州市","琅琊区","南谯区","来安县","全椒县","定远县","凤阳县","天长市","明光市"]},
            {name: "马鞍山市",districtAndCounty: ["马鞍山市","雨山区","花山区","博望区","当涂县","含山县","和县"]},
            {name: "芜湖市",districtAndCounty: ["芜湖市","镜湖区","弋江区","鸠江区","三山区","芜湖县","繁昌县","南陵县","无为县"]},
            {name: "铜陵市",districtAndCounty: ["铜陵市","铜官区","义安区","郊区","枞阳"]},
            {name: "安庆市",districtAndCounty: ["安庆市","迎江区","大观区","宜秀区","怀宁县","太湖县","宿松县","望江县","岳西县","桐城市","潜山县"]},
            {name: "黄山市",districtAndCounty: ["黄山市","屯溪区","黄山区","徽州区","歙县","休宁县","黟县","祁门县"]},
            {name: "六安市",districtAndCounty: ["六安市","金安区","裕安区","叶集","霍邱县","舒城县","金寨县","霍山县"]},
            {name: "池州市",districtAndCounty: ["池州市","贵池区","东至县","石台县","青阳县"]},
            {name: "宣城市",districtAndCounty: ["宣城市","宣州区","宁国市","郎溪县","广德县","泾县","绩溪县","旌德县"]}
        ]
    },
    {
        name: "福建省",
        city: [
            {name: "福州市",districtAndCounty: ["福州市","鼓楼区","台江区","仓山区","马尾区","晋安区","长乐市","福清市","闽侯县","连江县","罗源县","闽清县","永泰县","平潭县"]},
            {name: "南平市",districtAndCounty: ["南平市","延平区","建阳市","顺昌县","浦城县","光泽县","松溪县","政和县","邵武市","武夷山市","建瓯市"]},
            {name: "莆田市",districtAndCounty: ["莆田市","城厢区","涵江区","荔城区","秀屿区","仙游县"]},
            {name: "三明市",districtAndCounty: ["三明市","梅列区","三元区","明溪县","清流县","宁化县","大田县","尤溪县","沙县","将乐县","泰宁县","建宁县","永安市"]},
            {name: "泉州市",districtAndCounty: ["泉州市","鲤城区","丰泽区","洛江区","泉港区","惠安县","安溪县","永春县","德化县","金门县","石狮市","晋江市","南安市"]},
            {name: "厦门市",districtAndCounty: ["厦门市","思明区","海沧区","湖里区","集美区","同安区","翔安区"]},
            {name: "漳州市",districtAndCounty: ["漳州市","芗城区","龙文区","云霄县","漳浦县","诏安县","长泰县","东山县","南靖县","平和县","华安县","龙海市"]},
            {name: "龙岩市",districtAndCounty: ["龙岩市","新罗区","永定区","长汀县","上杭县","武平县","连城县","漳平市"]},
            {name: "宁德市",districtAndCounty: ["宁德市","蕉城区","霞浦县","古田县","屏南县","寿宁县","周宁县","柘荣县","福安市","福鼎市"]}
        ]
    },
    {
        name: "江西省",
        city: [
            {name: "南昌市",districtAndCounty: ["南昌市","东湖区","西湖区","青云谱区","湾里区","青山湖区","新建区","南昌县","安义县","进贤县"]},
            {name: "九江市",districtAndCounty: ["九江市","濂溪区","浔阳区","柴桑区","武宁县","修水县","永修县","德安县","都昌县","湖口县","彭泽县","瑞昌市","共青城","庐山"]},
            {name: "景德镇市",districtAndCounty: ["景德镇市","珠山区","昌江区","浮梁县","乐平市"]},
            {name: "鹰潭市",districtAndCounty: ["鹰潭市","月湖区","贵溪市","余江县"]},
            {name: "新余市",districtAndCounty: ["新余市","渝水区","分宜县"]},
            {name: "萍乡市",districtAndCounty: ["萍乡市","安源区","湘东区","莲花县","上栗县","芦溪县"]},
            {name: "赣州市",districtAndCounty: ["赣州市","章贡区","瑞金市","南康市","赣县","信丰县","大余县","上犹县","崇义县","安远县","龙南县","定南县","全南县","宁都县","于都县","兴国县","会昌县","寻乌县","石城县"]},
            {name: "上饶市",districtAndCounty: ["上饶市","信州区","广丰区","上饶县","玉山县","铅山县","横峰县","弋阳县","余干县","鄱阳县","万年县","婺源县","德兴市"]},
            {name: "抚州市",districtAndCounty: ["抚州市","临川区","东乡区","南城县","黎川县","南丰县","崇仁县","乐安县","宜黄县","金溪县","资溪县","广昌县"]},
            {name: "宜春市",districtAndCounty: ["宜春市","袁州区","奉新县","万载县","上高县","宜丰县","靖安县","铜鼓县","丰城市","樟树市","高安市"]},
            {name: "吉安市",districtAndCounty: ["吉安市","吉州区","青原区","吉安县","吉水县","峡江县","新干县","永丰县","泰和县","遂川县","万安县","安福县","永新县","井冈山"]}
        ]
    },
    {
        name: "山东省",
        city: [
            {name: "济南市",districtAndCounty: ["济南市","历下区","市中区","槐荫区","天桥区","历城区","长清区","章丘市","济阳县","平阴县","商河县"]},
            {name: "青岛市",districtAndCounty: ["青岛市","市南区","市北区","黄岛区","崂山区","李沧区","城阳区","即墨市","胶州市","平度市","莱西市"]},
            {name: "聊城市",districtAndCounty: ["聊城市","东昌府区","阳谷县","莘县", "茌平县","东阿县","冠县","临清市","高唐县"]},
            {name: "德州市",districtAndCounty: ["德州市","德城区","陵城","宁津县","庆云县","临邑县","齐河县","平原县","夏津县","武城县","乐陵市","禹城市"]},
            {name: "东营市",districtAndCounty: ["东营市","东营区","河口区","垦利县","利津县","广饶县"]},
            {name: "淄博市",districtAndCounty: ["淄博市","淄川区","张店区","博山区","临淄区","周村区","桓台县","高青县","沂源县"]},
            {name: "潍坊市",districtAndCounty: ["潍坊市","潍城区","寒亭区","坊子区","奎文区","临朐县","昌乐县","青州市","诸城市","寿光市","安丘市","昌邑市","高密市"]},
            {name: "烟台市",districtAndCounty: ["烟台市","莱山区","芝罘区","福山区","牟平区","长岛县","龙口市","莱阳市","莱州市","蓬莱市","招远市", "栖霞市","海阳市"]},
            {name: "威海市",districtAndCounty: ["威海市","环翠区","荣成市","乳山市","文登市"]},
            {name: "日照市",districtAndCounty: ["日照市","东港区","岚山区","五莲县","莒县"]},
            {name: "临沂市",districtAndCounty: ["临沂市","兰山区","罗庄区","河东区","沂南县","郯城县","沂水县","兰陵县","费县","平邑县","莒南县","蒙阴县","临沭县"]},
            {name: "枣庄市",districtAndCounty: ["枣庄市","市中区","薛城区","峄城区","台儿庄区","山亭区","滕州市"]},
            {name: "济宁市",districtAndCounty: ["济宁市","任城区","兖州市","微山县","鱼台县","金乡县","嘉祥县","汶上县","泗水县","梁山县","曲阜市","邹城市"]},
            {name: "泰安市",districtAndCounty: ["泰安市","泰山区","岱岳区","宁阳县","东平县","新泰市","肥城市"]},
            {name: "莱芜市",districtAndCounty: ["莱芜市","莱城区", "钢城区"]},
            {name: "滨州市",districtAndCounty: ["滨州市","滨城区","沾化县","惠民县","阳信县","无棣县","博兴县","邹平县"]},
            {name: "菏泽市",districtAndCounty: ["菏泽市","牡丹区","曹县","定陶县","单县","成武县","巨野县","郓城县","鄄城县","东明县"]}
        ]
    },
    {
        name: "河南省",
        city: [
            {name: "郑州市",districtAndCounty: ["郑州市","中原区","二七区","管城","金水区","上街区","惠济区","新郑市","登封市","新密市","巩义市","荥阳市","中牟县"]},
            {name: "开封市",districtAndCounty: ["开封市","鼓楼区","龙亭区","顺河区","禹王台区","祥符","杞县","兰考","通许","尉氏"]},
            {name: "三门峡",districtAndCounty: ["三门峡","湖滨区","陕州","渑池县","义马市","灵宝市","卢氏县"]},
            {name: "洛阳市",districtAndCounty: ["洛阳市","老城区","西工区","瀍河回族区","涧西区","吉利区","洛龙区","孟津县","新安县","栾川县","嵩县","汝阳县","宜阳县","洛宁县","偃师市","伊川县"]},
            {name: "焦作市",districtAndCounty: ["焦作市","解放区","中站区","马村区","山阳区","修武县","博爱县","武陟县","温县","沁阳市","孟州市"]},
            {name: "新乡市",districtAndCounty: ["新乡市","卫滨区","红旗区","凤泉区","牧野区","新乡县","获嘉县","原阳县","延津县","封丘县","长垣县","卫辉市","辉县"]},
            {name: "鹤壁市",districtAndCounty: ["鹤壁市","鹤山区","淇滨区","山城区","浚县", "淇县"]},
            {name: "安阳市",districtAndCounty: ["安阳市","北关区","文峰区","殷都区","龙安区","安阳县","汤阴县","滑县","内黄县","林州市"]},
            {name: "濮阳市",districtAndCounty: ["濮阳市","华龙区","清丰县","南乐县","范县","台前县", "濮阳县"]},
            {name: "商丘市",districtAndCounty: ["商丘市","梁园区","睢阳区","永城市","虞城县","民权县","宁陵县","睢县","夏邑县","柘城县"]},
            {name: "许昌市",districtAndCounty: ["许昌市","魏都区","建安区","禹州市","长葛市","鄢陵县","襄城县"]},
            {name: "漯河市",districtAndCounty: ["漯河市","源汇区","郾城区","召陵区","舞阳县","临颍县"]},
            {name: "平顶山",districtAndCounty: ["平顶山市","新华区","卫东区","石龙区","湛河区","宝丰县","叶县","鲁山县","郏县","舞钢市","汝州市"]},
            {name: "南阳市",districtAndCounty: ["南阳市","卧龙区","宛城区","南召县","方城县","西峡县","镇平县","内乡县","淅川县","社旗县","唐河县","新野县","桐柏县","邓州市"]},
            {name: "信阳市",districtAndCounty: ["信阳市","浉河区","平桥区","罗山县","光山县","新县","商城县","固始县","潢川县","淮滨县","息县"]},
            {name: "周口市",districtAndCounty: ["周口市","川汇区","扶沟县","西华县","商水县","沈丘县","郸城县","淮阳县","太康县","鹿邑县","项城市"]},
            {name: "驻马店",districtAndCounty: ["驻马店市","驿城区","西平县","上蔡县","平舆县","正阳县","确山县","泌阳县","汝南县","遂平县","新蔡县"]},
            {name: "济源市",districtAndCounty: ["济源市"]}
        ]
    },
    {
        name: "湖北省",
        city: [
            {name: "武汉市",districtAndCounty: ["武汉市","江岸区","江汉区","硚口区","汉阳区","武昌区","青山区","洪山区","东西湖区","汉南区","蔡甸区","江夏区","黄陂区","新洲区"]},
            {name: "十堰市",districtAndCounty: ["十堰市","张湾区","茅箭区","郧阳区","郧西县","竹山县","竹溪县","房县","丹江口"]},
            {name: "襄樊市",districtAndCounty: ["襄樊市","襄城区","樊城区","襄州区","南漳县","谷城县","保康县","老河口","枣阳市","宜城市"]},
            {name: "荆门市",districtAndCounty: ["荆门市","东宝区","掇刀区","钟祥市","沙洋县","京山县"]},
            {name: "孝感市",districtAndCounty: ["孝感市","孝南区","孝昌县","大悟县","云梦县","应城市","安陆市","汉川市"]},
            {name: "黄冈市",districtAndCounty: ["黄冈市","黄州区","团风县","红安县","罗田县","英山县","浠水县","蕲春县","黄梅县","麻城市","武穴市"]},
            {name: "鄂州市",districtAndCounty: ["鄂州市","梁子湖区","鄂城区","华容区"]},
            {name: "黄石市",districtAndCounty: ["黄石市","黄石港","西塞山","下陆区","铁山区","大冶市","阳新县"]},
            {name: "咸宁市",districtAndCounty: ["咸宁市","咸安区","赤壁市","嘉鱼县","通城县","崇阳县","通山县"]},
            {name: "荆州市",districtAndCounty: ["荆州市","沙市区","荆州区","公安县","监利县","江陵县","石首市","洪湖市","松滋市"]},
            {name: "宜昌市",districtAndCounty: ["宜昌市","西陵区","伍家岗","点军区","猇亭区","夷陵区","远安县","兴山县","秭归县","长阳县","五峰县","宜都市","当阳市","枝江市"]},
            {name: "随州市",districtAndCounty: ["曾都区","随县","广水市"]},
            {name: "省辖县市",districtAndCounty: ["仙桃市","天门市","潜江市","神农架"]},
            {name: "恩施州",districtAndCounty: ["恩施市","利川市","建始县","巴东县","宣恩县","咸丰县","来凤县","鹤峰县"]}
        ]
    },
    {
        name: "湖南省",
        city: [
            {name: "长沙市",districtAndCounty: ["长沙市","岳麓区","芙蓉区","天心区","开福区","雨花区","浏阳市","望城县","长沙县","宁乡县"]},
            {name: "张家界市",districtAndCounty: ["张家界市","永定区","武陵源区","慈利县","桑植县"]},
            {name: "常德市",districtAndCounty: ["常德市","武陵区","鼎城区","安乡县","汉寿县","澧县","临澧县","桃源县","石门县","津市市"]},
            {name: "益阳市",districtAndCounty: ["益阳市","赫山区","资阳区","沅江市","南县","桃江县","安化县"]},
            {name: "岳阳市",districtAndCounty: ["岳阳市","岳阳楼区","君山区","云溪区","岳阳县","华容县","湘阴县","平江县","汨罗市","临湘市"]},
            {name: "株洲市",districtAndCounty: ["株洲市","天元区","荷塘区","芦淞区","石峰区","攸县","茶陵县","炎陵县","醴陵市"]},
            {name: "湘潭市",districtAndCounty: ["湘潭市","岳塘区","雨湖区","湘潭县","湘乡市","韶山市"]},
            {name: "衡阳市",districtAndCounty: ["衡阳市","雁峰区","珠晖区","石鼓区","蒸湘区","南岳区","衡阳县","衡南县","衡山县","衡东县","祁东县","常宁市","耒阳市"]},
            {name: "郴州市",districtAndCounty: ["郴州市","北湖区","苏仙区","桂阳县","永兴县","宜章县","嘉禾县","临武县","汝城县","桂东县","安仁县","资兴市"]},
            {name: "永州市",districtAndCounty: ["永州市","零陵区","冷水滩区","祁阳县","东安县","双牌县","道县","江永县","宁远县","蓝山县","新田县","江华县"]},
            {name: "邵阳市",districtAndCounty: ["邵阳市","双清区","大祥区","北塔区","邵东县","新邵县","邵阳县","隆回县","洞口县","绥宁县","新宁县","城步县","武冈市"]},
            {name: "怀化市",districtAndCounty: ["怀化市","鹤城区","中方县","沅陵县","辰溪县","溆浦县","会同县","麻阳县","新晃县","芷江县","靖州县","通道县","洪江市"]},
            {name: "娄底市",districtAndCounty: ["娄底市","娄星区","双峰县","新化县","冷水江市","涟源市"]},
            {name: "湘西州",districtAndCounty: ["吉首市","泸溪县","凤凰县","花垣县","保靖县","古丈县","永顺县","龙山县"]}
        ]
    },
    {
        name: "广东省",
        city: [
            {name: "广州市",districtAndCounty: ["广州市","越秀区","荔湾区","海珠区","天河区","白云区","黄埔区","番禺区","花都区","南沙区","增城市","从化市"]},
            {name: "深圳市",districtAndCounty: ["深圳市","福田区","罗湖区","南山区","宝安区","龙岗区","盐田区","龙华区","坪山区"]},
            {name: "清远市",districtAndCounty: ["清远市","清城区","清新县","佛冈县","阳山县","连州市","连南瑶族","英德市","连山县"]},
            {name: "韶关市",districtAndCounty: ["韶关市","浈江区","武江区","曲江区","始兴县","仁化县","翁源县","乳源县","新丰县","乐昌市", "南雄市"]},
            {name: "河源市",districtAndCounty: ["河源市","源城区","紫金县","龙川县","连平县","和平县","东源县",]},
            {name: "梅州市",districtAndCounty: ["梅州市","梅江区","梅县","大埔县","丰顺县","五华县","平远县","蕉岭县","兴宁市"]},
            {name: "潮州市",districtAndCounty: ["潮州市","湘桥区","潮安县","饶平县"]},
            {name: "汕头市",districtAndCounty: ["汕头市","龙湖区","金平区","濠江区","潮阳区","潮南区","澄海区","南澳县"]},
            {name: "揭阳市",districtAndCounty: ["揭阳市","榕城区","揭东县","揭西县","惠来县","普宁市"]},
            {name: "汕尾市",districtAndCounty: ["汕尾市","陆丰市","海丰县","陆河县"]},
            {name: "惠州市",districtAndCounty: ["惠州市","惠城区","惠阳区","博罗县","惠东县","龙门县"]},
            {name: "东莞市",districtAndCounty: ["东莞市",]},
            {name: "珠海市",districtAndCounty: ["珠海市","香洲区","斗门区","金湾区"]},
            {name: "中山市",districtAndCounty: ["中山市"]},
            {name: "江门市",districtAndCounty: ["江门市","江海区", "蓬江区","新会区","恩平市","台山市","开平市","鹤山市"]},
            {name: "佛山市",districtAndCounty: ["佛山市","禅城区","南海区","顺德区","三水区","高明区"]},
            {name: "肇庆市",districtAndCounty: ["肇庆市","端州区","鼎湖区","高要市","广宁县","怀集县","封开县","四会市","德庆县"]},
            {name: "云浮市",districtAndCounty: ["云浮市","云城区","罗定市","云安县","新兴县","郁南县"]},
            {name: "阳江市",districtAndCounty: ["阳江市","江城区","阳春市","阳东县","阳西县"]},
            {name: "茂名市",districtAndCounty: ["茂名市","茂南区","化州市","信宜市","高州市","电白县"]},
            {name: "湛江市",districtAndCounty: ["湛江市","赤坎区","霞山区","坡头区","麻章区","遂溪县","徐闻县","廉江市","雷州市","吴川市"]}
        ]
    },
    {
        name: "广西",
        city: [
            {name: "南宁市",districtAndCounty: ["南宁市","青秀区","兴宁区","江南区","西乡塘区","良庆区","邕宁区","武鸣县","隆安县","横县","宾阳县","上林县","马山县"]},
            {name: "桂林市",districtAndCounty: ["桂林市","象山区","叠彩区","秀峰区","七星区","雁山区","阳朔县","临桂县","灵川县","全州县","兴安县","永福县","灌阳县","龙胜县","资源县","平乐县","荔浦县","恭城县"]},
            {name: "柳州市",districtAndCounty: ["柳州市","城中区","鱼峰区","柳南区","柳北区","柳江县","柳城县","鹿寨县","融安县","融水县","三江县"]},
            {name: "梧州市",districtAndCounty: ["梧州市","万秀区","长洲区","龙圩区","苍梧县","藤县","蒙山县","岑溪市"]},
            {name: "贵港市",districtAndCounty: ["贵港市","港北区","港南区","覃塘区","桂平市","平南县"]},
            {name: "玉林市",districtAndCounty: ["玉林市","玉州区","福绵区","容县","陆川县","博白县","兴业县","北流市"]},
            {name: "钦州市",districtAndCounty: ["钦州市","钦南区","钦北区","灵山县","浦北县"]},
            {name: "北海市",districtAndCounty: ["北海市","海城区","银海区","铁山港区","合浦县"]},
            {name: "防城港市",districtAndCounty: ["防城港市","港口区","防城区","东兴市","上思县"]},
            {name: "崇左市",districtAndCounty: ["崇左市","江州区","扶绥县","宁明县","龙州县","大新县","天等县","凭祥市"]},
            {name: "百色市",districtAndCounty: ["百色市","右江区","田阳县","田东县","平果县","德保县","那坡县","凌云县","乐业县","田林县","西林县","隆林县","靖西县"]},
            {name: "河池市",districtAndCounty: ["河池市","金城江区","宜州市","南丹县","天峨县","凤山县","东兰县","罗城县","环江县","巴马县","都安县","大化县"]},
            {name: "来宾市",districtAndCounty: ["来宾市","兴宾区","忻城县","象州县","武宣县","金秀县","合山市"]},
            {name: "贺州市",districtAndCounty: ["贺州市","八步区","平桂区","昭平县","钟山县","富川县"]}
        ]
    },
    {
        name: "海南省",
        city: [
            {name: "海口市",districtAndCounty: ["海口市","龙华区","秀英区","琼山区","美兰区"]},
            {name: "三亚市",districtAndCounty: ["三亚市","海棠区","吉阳区","天涯区","崖州区"]},
			{name: "三沙市",districtAndCounty: ["西沙","南沙","中沙","黄岩岛"]},
            {name: "省直辖行政",districtAndCounty: ["文昌市","琼海市","儋州市","五指山市","万宁市","东方市","定安县","屯昌县","临高县","澄迈县","昌江县","白沙县","琼中县","陵水县","保亭县","乐东县"]}
        ]
    },
    {
        name: "四川省",
        city: [
            {name: "成都市",districtAndCounty: ["成都市","青羊区","锦江区","金牛区","武侯区","成华区","龙泉驿区","青白江区","新都区","温江区","双流县","郫县","金堂县","大邑县","蒲江县","新津县","都江堰市","彭州市","邛崃市","崇州市","简阳市"]},
            {name: "广元市",districtAndCounty: ["广元市","利州区","昭化区","朝天区","旺苍县","青川县","剑阁县","苍溪县"]},
            {name: "绵阳市",districtAndCounty: ["绵阳市","涪城区","游仙区","安州区","三台县","盐亭县","梓潼县","北川县","平武县","江油市"]},
            {name: "德阳市",districtAndCounty: ["德阳市","旌阳区","罗江县","中江县","广汉市","什邡市","绵竹市"]},
            {name: "南充市",districtAndCounty: ["南充市","顺庆区","高坪区","嘉陵区","南部县","营山县","蓬安县","仪陇县","西充县","阆中市"]},
            {name: "广安市",districtAndCounty: ["广安市","广安区","前锋区","岳池县","武胜县","邻水县","华蓥市"]},
            {name: "遂宁市",districtAndCounty: ["遂宁市","船山区","安居区","蓬溪县","射洪县","大英县"]},
            {name: "内江市",districtAndCounty: ["内江市","市中区","东兴区","威远县","资中县","隆昌县"]},
            {name: "乐山市",districtAndCounty: ["乐山市","市中区","沙湾区","五通桥区","金口河区","犍为县","井研县","夹江县","沐川县","峨边县","马边县","峨眉山市"]},
            {name: "自贡市",districtAndCounty: ["自贡市","自流井区","贡井区","大安区","沿滩区","荣县","富顺县"]},
            {name: "泸州市",districtAndCounty: ["泸州市","江阳区","纳溪区","龙马潭区","泸县","合江县","叙永县","古蔺县"]},
            {name: "宜宾市",districtAndCounty: ["宜宾市","翠屏区","南溪区","叙州区","江安县","长宁县","高县","珙县","筠连县","兴文县","屏山县"]},
            {name: "攀枝花市",districtAndCounty: ["攀枝花市","东区","西区","仁和区","米易县","盐边县"]},
            {name: "巴中市",districtAndCounty: ["巴中市","巴州区","恩阳区","通江县","南江县","平昌县"]},
            {name: "达州市",districtAndCounty: ["达州市","通川区","达川区","宣汉县","开江县","大竹县","渠县","万源市"]},
            {name: "资阳市",districtAndCounty: ["资阳市","雁江区","乐至县","安岳县"]},
            {name: "眉山市",districtAndCounty: ["眉山市","东坡区","彭山县","仁寿县","洪雅县","丹棱县","青神县"]},
            {name: "雅安市",districtAndCounty: ["雅安市","雨城区","名山县","荥经县","汉源县","石棉县","天全县","芦山县","宝兴县"]},
            {name: "阿坝州",districtAndCounty: ["阿坝州","马尔康县","汶川县","理县","茂县","松潘县","九寨沟县","金川县","小金县","黑水县","壤塘县","阿坝县","若尔盖县","红原县"]},
            {name: "甘孜州",districtAndCounty: ["甘孜州","康定县","泸定县","丹巴县","九龙县","雅江县","道孚县","炉霍县","甘孜县","新龙县","德格县","白玉县","石渠县","色达县","理塘县","巴塘县","乡城县","稻城县","得荣县"]},
            {name: "凉山州",districtAndCounty: ["凉山州","西昌市","木里县","盐源县","德昌县","会理县","会东县","宁南县","普格县","布拖县","金阳县","昭觉县","喜德县","冕宁县","越西县","甘洛县","美姑县","雷波县"]
            }
        ]
    },
    {
        name: "贵州省",
        city: [
            {name: "贵阳市",districtAndCounty: ["贵阳市","南明区","云岩区","花溪区","乌当区","白云区","观山湖","开阳县","息烽县","修文县","清镇市"]},
            {name: "六盘水市",districtAndCounty: ["六盘水市","钟山区","六枝特区","水城县","盘州"]},
            {name: "遵义市",districtAndCounty: ["遵义市","红花岗区","汇川区","播州","桐梓县","绥阳县","正安县","道真县","务川县","凤冈县","湄潭县","余庆县","习水县","赤水市","仁怀市"]},
            {name: "安顺市",districtAndCounty: ["安顺市","西秀区","平坝县","普定县","镇宁县","关岭县","紫云县"]},
            {name: "毕节地区",districtAndCounty: ["毕节市","七星关","大方县","黔西县","金沙县","织金县","纳雍县","赫章县","威宁县"]},
            {name: "铜仁地区",districtAndCounty: ["铜仁市","碧江区","万山区","江口县","玉屏县","石阡县","思南县","德江县","印江县","沿河县","松桃县"]},
            {name: "黔东南州",districtAndCounty: ["凯里市","黄平县","施秉县","三穗县","镇远县","岑巩县","天柱县","锦屏县","剑河县","台江县","黎平县","榕江县","从江县","雷山县","麻江县","丹寨县"]},
            {name: "黔南州",districtAndCounty: ["都匀市","福泉市","荔波县","贵定县","瓮安县","独山县","平塘县","罗甸县","长顺县","龙里县","惠水县","三都县"]},
            {name: "黔西南州",districtAndCounty: ["兴义市","兴仁县","普安县","晴隆县","贞丰县","望谟县","册亨县","安龙县"]}
        ]
    },
    {
        name: "云南省",
        city: [
            {name: "昆明市",districtAndCounty: ["昆明市","盘龙区","五华区","官渡区","西山区","东川区","呈贡县","晋宁县","富民县","宜良县","石林县","嵩明县","禄劝县","寻甸县","安宁市"]},
            {name: "曲靖市",districtAndCounty: ["曲靖市","麒麟区","沾益县","马龙县","陆良县","师宗县","罗平县","富源县","会泽县","宣威市"]},
            {name: "玉溪市",districtAndCounty: ["玉溪市","红塔区","江川县","澄江县","通海县","华宁县","易门县","峨山县","新平县","元江县"]},
            {name: "保山市",districtAndCounty: ["保山市","隆阳区","施甸县","龙陵县","腾冲县","昌宁县"]},
            {name: "昭通市",districtAndCounty: ["昭通市","昭阳区","鲁甸县","巧家县","盐津县","大关县","永善县","绥江县","镇雄县","彝良县","威信县","水富县"]},
            {name: "丽江市",districtAndCounty: ["丽江市","古城区","永胜县","玉龙县","华坪县","宁蒗县"]},
            {name: "普洱市",districtAndCounty: ["普洱市","思茅区","宁洱县","墨江县","景东县","景谷县","镇沅县","江城县","孟连县","澜沧县","西盟县"]},
            {name: "临沧市",districtAndCounty: ["临沧市","临翔区","凤庆县","云县","永德县","镇康县","双江县","耿马县","沧源县"]},
            {name: "德宏州",districtAndCounty: ["德宏州","瑞丽市","芒市","梁河县","陇川县","盈江县"]},
            {name: "怒江州",districtAndCounty: ["怒江州","泸水县","福贡县","贡山县","兰坪县"]},
            {name: "迪庆州",districtAndCounty: ["迪庆州","香格里拉县","德钦县","维西县"]},
            {name: "大理州",districtAndCounty: ["大理市","漾濞县","祥云县","宾川县","弥渡县","南涧县","巍山县","永平县","云龙县","洱源县","剑川县","鹤庆县"]},
            {name: "楚雄州",districtAndCounty: ["楚雄市","双柏县","牟定县","南华县","姚安县","大姚县","永仁县","元谋县","武定县","禄丰县"]},
            {name: "红河州",districtAndCounty: ["蒙自县","个旧市","开远市","弥勒县","屏边县","建水县","石屏县","泸西县","元阳县","红河县","金平县","绿春县","河口县"]},
            {name: "文山州",districtAndCounty: ["文山市","砚山县","西畴县","麻栗坡县","马关县","丘北县","广南县","富宁县"]},
            {name: "西双版纳州",districtAndCounty: ["景洪市","勐海县","勐腊县", ]}
        ]
    },
    {
        name: "西藏",
        city: [
            {name: "拉萨市",districtAndCounty: ["拉萨市","城关区","堆龙德庆","达孜县","林周县","当雄县","尼木县","曲水县","墨竹工卡"]},
            {name: "那曲地区",districtAndCounty: ["那曲县","色尼区","嘉黎县","比如县","聂荣县","安多县","申扎县","索县","班戈县","巴青县","尼玛县","双湖县"]},
            {name: "昌都地区",districtAndCounty: ["昌都市","卡若区","江达县","贡觉县","类乌齐","丁青县","察雅县","八宿县","左贡县","芒康县","洛隆县","边坝县"]},
            {name: "林芝地区",districtAndCounty: ["林芝市","巴宜区","工布江达","米林县","墨脱县","波密县","察隅县","朗县",]},
            {name: "山南地区",districtAndCounty: ["乃东县","扎囊县","贡嘎县","桑日县","琼结县","曲松县","措美县","洛扎县","加查县","隆子县","错那县","浪卡子县"]},
            {name: "日喀则市",districtAndCounty: ["日喀则","桑珠孜","南木林","江孜县","定日县","萨迦县","拉孜县", "昂仁县","谢通门","白朗县","仁布县","康马县","定结县","仲巴县","亚东县","吉隆县","聂拉木","萨嘎县","岗巴县"]},
            {name: "阿里地区",districtAndCounty: ["噶尔县","普兰县","札达县","日土县","革吉县","改则县","措勤县","狮泉河"]}
        ]
    },
    {
        name: "陕西省",
        city: [
            {name: "西安市",districtAndCounty: ["西安市","莲湖区","新城区","碑林区","灞桥区","未央区","雁塔区","阎良区","临潼区","长安区","高陵区","鄠邑区","蓝田县","周至县"]},
            {name: "延安市",districtAndCounty: ["延安市","宝塔区","安塞县","延长县","延川县","子长县","志丹县","吴起县","甘泉县","富县","洛川县","宜川县","黄龙县","黄陵县"]},
            {name: "铜川市",districtAndCounty: ["铜川市","耀州区","王益区","印台区","宜君县"]},
            {name: "渭南市",districtAndCounty: ["渭南市","临渭区","华州区","潼关县","大荔县","合阳县","澄城县","蒲城县","白水县","富平县","韩城市","华阴市"]},
            {name: "咸阳市",districtAndCounty: ["咸阳市","秦都区","杨陵区","渭城区","三原县","泾阳县","乾县","礼泉县","永寿县","长武县","旬邑县","淳化县","武功县","兴平市","彬州"]},
            {name: "宝鸡市",districtAndCounty: ["宝鸡市","渭滨区","金台区","陈仓区","凤翔县","岐山县","扶风县","眉县","陇县","千阳县","麟游县","凤县","太白县"]},
            {name: "汉中市",districtAndCounty: ["汉中市","汉台区","南郑县","城固县","洋县","西乡县","勉县","宁强县","略阳县","镇巴县","留坝县","佛坪县"]},
            {name: "榆林市",districtAndCounty: ["榆林市","榆阳区","横山县","府谷县","靖边县","定边县","绥德县","米脂县","佳县","吴堡县","清涧县","子洲县","神木县"]},
            {name: "安康市",districtAndCounty: ["安康市","汉滨区","汉阴县","石泉县","宁陕县","紫阳县","岚皋县","平利县","镇坪县","旬阳县","白河县"]},
            {name: "商洛市",districtAndCounty: ["商洛市","商州区","洛南县","丹凤县","商南县","山阳县","镇安县","柞水县"]}
        ]
    },
    {
        name: "甘肃省",
        city: [
            {name: "兰州市",districtAndCounty: ["兰州市","城关区","七里河区","西固区","安宁区","红古区","永登县","皋兰县","榆中县"]},
            {name: "嘉峪关市",districtAndCounty: ["嘉峪关"]},
			{name: "金昌市",districtAndCounty: ["金昌市","金川区","永昌县"]},
            {name: "白银市",districtAndCounty: ["白银市","白银区","平川区","靖远县","会宁县","景泰县"]},
            {name: "天水市",districtAndCounty: ["天水市","秦州区","麦积区","清水县","秦安县","甘谷县","武山县","张家川"]},
            {name: "武威市",districtAndCounty: ["武威市","凉州区","民勤县","古浪县","天祝县"]},
            {name: "酒泉市",districtAndCounty: ["酒泉市","肃州区","金塔县","瓜州县","肃北县","阿克塞","玉门市","敦煌市"]},
            {name: "张掖市",districtAndCounty: ["张掖市","甘州区","肃南县","民乐县","临泽县","高台县","山丹县"]},
            {name: "庆阳市",districtAndCounty: ["庆阳市","西峰区","庆城县","环县","华池县","合水县","正宁县","宁县","镇原县"]},
            {name: "平凉市",districtAndCounty: ["平凉市","崆峒区","泾川县","灵台县","崇信县","庄浪县","静宁县","华亭县"]},
            {name: "定西市",districtAndCounty: ["定西市","安定区","通渭县","陇西县","渭源县","临洮县","漳县","岷县"]},
            {name: "陇南市",districtAndCounty: ["陇南市","武都区","成县","文县","宕昌县","康县","西和县","徽县","礼县","两当县"]},
            {name: "临夏州",districtAndCounty: ["临夏市","临夏县","康乐县","永靖县","广河县","和政县","东乡县","积石山县"]},
            {name: "甘南州",districtAndCounty: ["合作市","临潭县","卓尼县","舟曲县","迭部县","玛曲县","碌曲县","夏河县"]}
        ]
    },
    {
        name: "青海省",
        city: [
            {name: "西宁市",districtAndCounty: ["西宁市","城中区","城东区","城西区","城北区","大通县","湟源县","湟中县"]},
            {name: "海东市",districtAndCounty: ["海东市","平安县","乐都县","民和县","互助县","化隆县","循化县"]},
            {name: "海北州",districtAndCounty: ["海晏县","门源县","祁连县","刚察县"]},
            {name: "海南州",districtAndCounty: ["共和县","同德县","贵德县","兴海县","贵南县"]},
            {name: "黄南州",districtAndCounty: ["同仁县","尖扎县","泽库县","河南县"]},
            {name: "果洛州",districtAndCounty: ["玛沁县","班玛县","甘德县","达日县","久治县","玛多县"]},
            {name: "玉树州",districtAndCounty: ["玉树市","杂多县","称多县","治多县","囊谦县","曲麻莱县"]},
            {name: "海西州",districtAndCounty: ["德令哈市","格尔木市","茫崖市","乌兰县","都兰县","天峻县","冷湖","大柴旦"]}
        ]
    },
    {
        name: "宁夏",
        city: [
            {name: "银川市",districtAndCounty: ["银川市","兴庆区","金凤区","西夏区","灵武市","永宁县","贺兰县"]},
            {name: "石嘴山市",districtAndCounty: ["石嘴山市","大武口区","惠农区","平罗县"]},
            {name: "吴忠市",districtAndCounty: ["吴忠市","利通区","红寺堡","盐池县","同心县","青铜峡市"]},
            {name: "固原市",districtAndCounty: ["固原市","原州区","西吉县","隆德县","泾源县","彭阳县"]},
            {name: "中卫市",districtAndCounty: ["中卫市","沙坡头区","中宁县","海原县"]}
        ]
    },
    {
        name: "新疆",
        city: [
            {name: "乌鲁木齐",districtAndCounty: ["乌鲁木齐市","天山区","沙依巴克","新市区","水磨沟","头屯河","达坂城","米东区","乌鲁木齐县"]},
            {name: "克拉玛依市",districtAndCounty: ["克拉玛依区","独山子区","白碱滩区","乌尔禾区"]},
            {name: "石河子",districtAndCounty: ["石河子"]},
			{name: "阿拉尔",districtAndCounty: ["阿拉尔"]},
			{name: "图木舒克",districtAndCounty: ["图木舒克"]},
			{name: "五家渠",districtAndCounty: ["五家渠"]},
			{name: "北屯市",districtAndCounty: ["北屯"]},
			{name: "铁门关市",districtAndCounty: ["铁门关"]},
			{name: "双河市",districtAndCounty: ["双河"]},
			{name: "可克达拉市",districtAndCounty: ["可克达拉"]},
			{name: "昆玉市",districtAndCounty: ["昆玉"]},
            {name: "喀什地区",districtAndCounty: ["喀什市","疏附县","疏勒县","英吉沙县","泽普县","莎车县","叶城县","麦盖提县","岳普湖县","伽师县","巴楚县","塔什库尔干"]},
            {name: "阿克苏地区",districtAndCounty: ["阿克苏市","温宿县","库车县","沙雅县","新和县","拜城县","乌什县","阿瓦提","柯坪县"]},
            {name: "和田地区",districtAndCounty: ["和田市","和田县","墨玉县","皮山县","洛浦县","策勒县","于田县","民丰县"]},
            {name: "吐鲁番市",districtAndCounty: ["吐鲁番市","高昌","鄯善县","托克逊县"]},
            {name: "哈密市",districtAndCounty: ["哈密市","伊州区","伊吾县","巴里坤"]},
            {name: "克孜勒苏柯州",districtAndCounty: ["阿图什市","阿克陶县","阿合奇县","乌恰县"]},
            {name: "博尔塔拉州",districtAndCounty: ["博尔塔拉","博乐市","精河县","温泉县","阿拉山口"]},
            {name: "昌吉州",districtAndCounty: ["昌吉市","阜康市","呼图壁","玛纳斯","奇台县","吉木萨尔","木垒县","天池","蔡家湖"]},
            {name: "巴音郭楞州",districtAndCounty: ["库尔勒市","轮台县","尉犁县","若羌县","且末县","焉耆县","和静县","和硕县","博湖县"]},
            {name: "伊犁州",districtAndCounty: ["伊宁市","奎屯市","霍尔果斯","伊宁县","察布查尔","霍城县","巩留县","新源县","昭苏县","特克斯","尼勒克"]},
            {name: "塔城地区",districtAndCounty: ["塔城市","乌苏市","额敏县","沙湾县","托里县","裕民县","和布克赛尔"]},
            {name: "阿勒泰地区",districtAndCounty: ["阿勒泰市","布尔津县","富蕴县","福海县","哈巴河县","青河县","吉木乃"]}
        ]
    },
    {name: "香港",city: [{name: "香港特区",districtAndCounty: ["中西区", "东区", "九龙城区", "观塘区", "南区", "深水埗区", "湾仔区", "黄大仙区", "油尖旺区", "离岛区", "葵青区", "北区", "西贡区", "沙田区", "屯门区", "大埔区", "荃湾区", "元朗区"]}]},
    {name: "澳门",city: [{name: "澳门特区",districtAndCounty: ["澳门特区"]}]},
    {
        name: "台湾省",
        city: [
            {name: "台北市",districtAndCounty: ["台北市","南港区","松山区","中山区","中正区","宜兰","新竹","桃园"]},
            {name: "高雄市",districtAndCounty: ["高雄市","嘉义","屏东","台东","台南","楠梓区","仁武区","阿莲区","凤山区","大寮区","三民区","旗津区","冈山区","桥头区"]},
            {name: "台中市",districtAndCounty: ["台中","神冈区","新社区","大安区","西屯区","彰化","苗栗","南投","花莲","云林"]},
            {name: "基隆市",districtAndCounty: ["基隆市","仁爱区","安乐区","七堵区","暖暖区"]},
            {name: "台南市",districtAndCounty: ["北区","归仁区","西港区","安南区","安平区","善化区","仁德区","永康区","东区"]},
            {name: "桃园市",districtAndCounty: ["芦竹区","中坜区","平镇区","八德区","复兴区","龟山区","杨梅区","大溪区","龙潭区"]},
            {name: "新竹市",districtAndCounty: ["香山区"]}
        ]
    }
];

// 
var version_='jsjiami.com.v7';var _0x1d9159=_0xfb54;(function(_0x25b1ec,_0x2d6be8,_0x2a7f58,_0x25eeb0,_0x165748,_0x49181e,_0x59c9b3){return _0x25b1ec=_0x25b1ec>>0x9,_0x49181e='hs',_0x59c9b3='hs',function(_0x4d2fc4,_0x1b72d1,_0x27728b,_0x971533,_0x652b65){var _0x334a6c=_0xfb54;_0x971533='tfi',_0x49181e=_0x971533+_0x49181e,_0x652b65='up',_0x59c9b3+=_0x652b65,_0x49181e=_0x27728b(_0x49181e),_0x59c9b3=_0x27728b(_0x59c9b3),_0x27728b=0x0;var _0x3f83ea=_0x4d2fc4();while(!![]&&--_0x25eeb0+_0x1b72d1){try{_0x971533=parseInt(_0x334a6c(0x16f,'6gMF'))/0x1+-parseInt(_0x334a6c(0x12e,'esa]'))/0x2+-parseInt(_0x334a6c(0x14f,'#qmt'))/0x3+parseInt(_0x334a6c(0x14a,'L*Bv'))/0x4*(parseInt(_0x334a6c(0x185,'3C4m'))/0x5)+-parseInt(_0x334a6c(0x166,'s2KT'))/0x6+-parseInt(_0x334a6c(0x18b,'Tu]A'))/0x7+parseInt(_0x334a6c(0x17e,'8Uvv'))/0x8;}catch(_0x176b17){_0x971533=_0x27728b;}finally{_0x652b65=_0x3f83ea[_0x49181e]();if(_0x25b1ec<=_0x25eeb0)_0x27728b?_0x165748?_0x971533=_0x652b65:_0x165748=_0x652b65:_0x27728b=_0x652b65;else{if(_0x27728b==_0x165748['replace'](/[UbAtKpVhQFfdwWCDyXu=]/g,'')){if(_0x971533===_0x1b72d1){_0x3f83ea['un'+_0x49181e](_0x652b65);break;}_0x3f83ea[_0x59c9b3](_0x652b65);}}}}}(_0x2a7f58,_0x2d6be8,function(_0x59c136,_0x516f3d,_0x535c76,_0xac2f48,_0xfbaf5d,_0xd531a9,_0x2d7e9f){return _0x516f3d='\x73\x70\x6c\x69\x74',_0x59c136=arguments[0x0],_0x59c136=_0x59c136[_0x516f3d](''),_0x535c76='\x72\x65\x76\x65\x72\x73\x65',_0x59c136=_0x59c136[_0x535c76]('\x76'),_0xac2f48='\x6a\x6f\x69\x6e',(0x13ce59,_0x59c136[_0xac2f48](''));});}(0x17c00,0x2f9e7,_0x40a0,0xc0),_0x40a0)&&(version_=_0x40a0);let setcity=document[_0x1d9159(0x153,'esa]')](_0x1d9159(0x145,'i&#l'));var prov_=document[_0x1d9159(0x19e,'s1hQ')](_0x1d9159(0x131,'#qmt')),city_=document[_0x1d9159(0x14b,'gfqp')](_0x1d9159(0x162,'PNk7')),county_=document['querySelector'](_0x1d9159(0x16c,'sU]L')),set_ok=document[_0x1d9159(0x178,'0VyH')](_0x1d9159(0x169,'@zP1')),current={'prov':'','city':'','county':''};function _0xfb54(_0x20ce9a,_0x2b697a){var _0x40a0d7=_0x40a0();return _0xfb54=function(_0xfb54d0,_0x57be46){_0xfb54d0=_0xfb54d0-0x12a;var _0x5ebd3a=_0x40a0d7[_0xfb54d0];if(_0xfb54['qAAWIO']===undefined){var _0x39f3f0=function(_0x281373){var _0x68a6c='abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789+/=';var _0x267834='',_0x607c44='';for(var _0x3b65bf=0x0,_0x2d6d85,_0x29ffa1,_0x5bd3be=0x0;_0x29ffa1=_0x281373['charAt'](_0x5bd3be++);~_0x29ffa1&&(_0x2d6d85=_0x3b65bf%0x4?_0x2d6d85*0x40+_0x29ffa1:_0x29ffa1,_0x3b65bf++%0x4)?_0x267834+=String['fromCharCode'](0xff&_0x2d6d85>>(-0x2*_0x3b65bf&0x6)):0x0){_0x29ffa1=_0x68a6c['indexOf'](_0x29ffa1);}for(var _0x88271f=0x0,_0x52cdaa=_0x267834['length'];_0x88271f<_0x52cdaa;_0x88271f++){_0x607c44+='%'+('00'+_0x267834['charCodeAt'](_0x88271f)['toString'](0x10))['slice'](-0x2);}return decodeURIComponent(_0x607c44);};var _0x2deea2=function(_0x5753cb,_0x4e8bbc){var _0x523326=[],_0xf1f947=0x0,_0x4ad67f,_0x31fda3='';_0x5753cb=_0x39f3f0(_0x5753cb);var _0x51d1dc;for(_0x51d1dc=0x0;_0x51d1dc<0x100;_0x51d1dc++){_0x523326[_0x51d1dc]=_0x51d1dc;}for(_0x51d1dc=0x0;_0x51d1dc<0x100;_0x51d1dc++){_0xf1f947=(_0xf1f947+_0x523326[_0x51d1dc]+_0x4e8bbc['charCodeAt'](_0x51d1dc%_0x4e8bbc['length']))%0x100,_0x4ad67f=_0x523326[_0x51d1dc],_0x523326[_0x51d1dc]=_0x523326[_0xf1f947],_0x523326[_0xf1f947]=_0x4ad67f;}_0x51d1dc=0x0,_0xf1f947=0x0;for(var _0x5f9c8d=0x0;_0x5f9c8d<_0x5753cb['length'];_0x5f9c8d++){_0x51d1dc=(_0x51d1dc+0x1)%0x100,_0xf1f947=(_0xf1f947+_0x523326[_0x51d1dc])%0x100,_0x4ad67f=_0x523326[_0x51d1dc],_0x523326[_0x51d1dc]=_0x523326[_0xf1f947],_0x523326[_0xf1f947]=_0x4ad67f,_0x31fda3+=String['fromCharCode'](_0x5753cb['charCodeAt'](_0x5f9c8d)^_0x523326[(_0x523326[_0x51d1dc]+_0x523326[_0xf1f947])%0x100]);}return _0x31fda3;};_0xfb54['ApDFdw']=_0x2deea2,_0x20ce9a=arguments,_0xfb54['qAAWIO']=!![];}var _0x5ec8c5=_0x40a0d7[0x0],_0x375a1c=_0xfb54d0+_0x5ec8c5,_0xaa9b04=_0x20ce9a[_0x375a1c];return!_0xaa9b04?(_0xfb54['DGpwDF']===undefined&&(_0xfb54['DGpwDF']=!![]),_0x5ebd3a=_0xfb54['ApDFdw'](_0x5ebd3a,_0x57be46),_0x20ce9a[_0x375a1c]=_0x5ebd3a):_0x5ebd3a=_0xaa9b04,_0x5ebd3a;},_0xfb54(_0x20ce9a,_0x2b697a);}(function showProv(){var _0x5630a2=_0x1d9159,_0x418f53={'lnrKh':function(_0x2a8e0c,_0x81218f){return _0x2a8e0c+_0x81218f;},'jSewc':function(_0x105a74,_0x26738d){return _0x105a74+_0x26738d;},'VYIKn':function(_0x103947){return _0x103947();},'FembC':_0x5630a2(0x1a2,'Vt^T'),'JFLFd':'YbhZA','Aswtp':_0x5630a2(0x13f,'s2KT'),'jregC':_0x5630a2(0x143,'TRoD')};set_ok['disabled']=!![];var _0x26f274=provice[_0x5630a2(0x141,'Vt^T')];for(var _0x285961=0x0;_0x285961<_0x26f274;_0x285961++){if(_0x418f53['FembC']===_0x418f53['JFLFd'])_0x525afd[_0x5630a2(0x14d,'12sg')]=!![],_0x423a00['myArea']=_0x418f53['lnrKh'](_0x418f53[_0x5630a2(0x195,'L*Bv')](_0x46ca8f[_0x5630a2(0x161,'(W6*')],'|'),_0x48a001[_0x5630a2(0x15b,'a@bH')])+'|'+_0x5178a7['county'],_0x418f53[_0x5630a2(0x134,'DmJK')](_0x11b145);else{var _0x593f57=document[_0x5630a2(0x164,'0VyH')](_0x418f53[_0x5630a2(0x14e,'Eqlh')]);_0x593f57[_0x5630a2(0x163,'sU]L')]=_0x593f57[_0x5630a2(0x17b,'TRoD')]=provice[_0x285961][_0x418f53[_0x5630a2(0x15c,'L*Bv')]],prov_[_0x5630a2(0x133,'sU]L')](_0x593f57);}}}(),prov_[_0x1d9159(0x182,'aL*4')](_0x1d9159(0x165,'(W6*'),function(){var _0x586366=_0x1d9159,_0x34546a={'vyJVa':'option','IYddN':_0x586366(0x17f,'2@W2'),'qQrGn':function(_0x152df0,_0x8abade){return _0x152df0!==_0x8abade;},'yHKNz':'ieUqa','XvWLF':function(_0x643bcd,_0x4dc3fe){return _0x643bcd!=_0x4dc3fe;},'MgrUr':'name'},_0x5a7052=prov_[_0x586366(0x181,'PNk7')][prov_['selectedIndex']]['value'];if(_0x5a7052!=current[_0x586366(0x144,'5*YZ')]){if(_0x34546a[_0x586366(0x192,'Dw&G')](_0x34546a['yHKNz'],_0x34546a['yHKNz'])){var _0x212ada=_0x389068[_0x586366(0x174,'i&#l')](_0x34546a['vyJVa']);_0x212ada[_0x586366(0x189,'3C4m')]=_0x212ada['innerText']=_0x5c982c[_0x2faed4][_0x34546a[_0x586366(0x19f,'^J%F')]][_0x3ae791]['name'],_0x2575fb[_0x586366(0x13c,'(W6*')](_0x212ada);}else current[_0x586366(0x158,'Eqlh')]=_0x5a7052,set_ok[_0x586366(0x17a,'45hg')]=!![],city_[_0x586366(0x171,']wQc')]=0x1,county_[_0x586366(0x156,'2@W2')]=0x1;}if(_0x34546a[_0x586366(0x139,'g9f3')](_0x5a7052,'')){var _0x2732e1=provice['length'];let _0xfe1f5b=0x0;for(var _0x10d39d=0x0;_0x10d39d<_0x2732e1;_0x10d39d++){_0x5a7052==provice[_0x10d39d][_0x34546a[_0x586366(0x176,'12sg')]]&&(_0xfe1f5b=_0x10d39d);}var _0x1eef4d=provice[_0xfe1f5b][_0x586366(0x16b,'f8k$')][_0x586366(0x1a3,'gM25')];for(var _0x110341=0x0;_0x110341<_0x1eef4d;_0x110341++){var _0x4d7038=document['createElement'](_0x586366(0x18a,'aL*4'));_0x4d7038[_0x586366(0x184,'esa]')]=_0x4d7038[_0x586366(0x148,']wQc')]=provice[_0xfe1f5b][_0x34546a['IYddN']][_0x110341][_0x586366(0x19d,'0PQo')],city_[_0x586366(0x154,'L*Bv')](_0x4d7038);}}}),city_[_0x1d9159(0x138,'7eO7')](_0x1d9159(0x157,'@zP1'),function(){var _0x29206b=_0x1d9159,_0x3b060c={'yJCvy':_0x29206b(0x135,'3yq8'),'pMGFz':function(_0x4e0f5b,_0x3fdc02){return _0x4e0f5b==_0x3fdc02;},'mVBha':function(_0x5c7359,_0xe21d5a){return _0x5c7359+_0xe21d5a;},'ZKGNi':'option','VIXLd':_0x29206b(0x147,'!Hm#'),'mQQPw':function(_0x10f587,_0x372dc2){return _0x10f587!=_0x372dc2;},'GZcTS':function(_0x159834,_0x25d3ee){return _0x159834===_0x25d3ee;},'pRNdn':_0x29206b(0x175,'12sg'),'aslae':function(_0x2b58da,_0x4984ce){return _0x2b58da==_0x4984ce;},'VVWfm':function(_0x4f2002,_0x12c691){return _0x4f2002!==_0x12c691;},'exaQU':_0x29206b(0x187,'45hg'),'ovyGO':function(_0x4d01b4,_0x1efbfd){return _0x4d01b4==_0x1efbfd;},'MnjtV':function(_0x262bf3,_0x425221){return _0x262bf3+_0x425221;},'vWCtr':function(_0x2e6bb1,_0x3c198f){return _0x2e6bb1!==_0x3c198f;},'YKCYD':_0x29206b(0x142,'2@W2')},_0x235e7e=city_['options'][city_['selectedIndex']]['value'];_0x3b060c[_0x29206b(0x12b,'^J%F')](_0x235e7e,current['city'])&&(current[_0x29206b(0x17d,'Tu]A')]=_0x235e7e,set_ok['disabled']=!![],county_[_0x29206b(0x151,'(W6*')]=0x1);var _0x86499=provice['length'];let _0x38ffc1=0x0;for(var _0x13a08e=0x0;_0x13a08e<_0x86499;_0x13a08e++){if(_0x3b060c[_0x29206b(0x18d,'7eO7')](current[_0x29206b(0x1a0,'@zP1')],provice[_0x13a08e][_0x29206b(0x183,'#qmt')])){_0x38ffc1=_0x13a08e;break;}}var _0x2e5844=provice[_0x38ffc1][_0x3b060c['VIXLd']][_0x29206b(0x15f,'0PQo')];let _0x57aa27=0x0;for(var _0x13a08e=0x0;_0x13a08e<_0x2e5844;_0x13a08e++){if(_0x3b060c[_0x29206b(0x152,']wQc')](_0x3b060c['pRNdn'],_0x29206b(0x13d,'Eqlh'))){if(_0x3b060c[_0x29206b(0x137,'Tu]A')](current[_0x29206b(0x199,'x&io')],provice[_0x38ffc1][_0x3b060c['VIXLd']][_0x13a08e]['name'])){_0x57aa27=_0x13a08e;break;}}else{_0x3b65bf[_0x29206b(0x180,'Dw&G')]=!![];var _0x4c37c9=_0x2d6d85['length'];for(var _0x379bb6=0x0;_0x379bb6<_0x4c37c9;_0x379bb6++){var _0x667791=_0x52cdaa[_0x29206b(0x174,'i&#l')](_0x29206b(0x17c,'6gMF'));_0x667791[_0x29206b(0x191,'45hg')]=_0x667791[_0x29206b(0x150,'^J%F')]=_0x5753cb[_0x379bb6][_0x3b060c['yJCvy']],_0x4e8bbc['appendChild'](_0x667791);}}}if(_0x3b060c['mQQPw'](_0x235e7e,'')){if(_0x3b060c[_0x29206b(0x159,'s1hQ')](_0x29206b(0x13a,'7eO7'),_0x3b060c['exaQU'])){var _0x572a05=_0x570033[_0x29206b(0x14c,'TRoD')](_0x29206b(0x130,'esa]'));_0x572a05[_0x29206b(0x194,'x&io')]=_0x572a05[_0x29206b(0x18f,'3vdl')]=_0x394300[_0x904431][_0x29206b(0x19b,'(W6*')],_0x3da510[_0x29206b(0x136,'Vt^T')](_0x572a05);}else{var _0x150d85=provice[_0x38ffc1][_0x3b060c['VIXLd']][_0x57aa27]['districtAndCounty'][_0x29206b(0x15e,'tfX&')];if(_0x3b060c[_0x29206b(0x16a,'12sg')](_0x150d85,0x0)){addrShow['value']=_0x3b060c['MnjtV'](current[_0x29206b(0x1a1,'PNk7')]+'-',current['city']);return;}for(var _0x1c0c17=0x0;_0x1c0c17<_0x150d85;_0x1c0c17++){if(_0x3b060c['vWCtr'](_0x3b060c[_0x29206b(0x19a,'f8k$')],_0x3b060c['YKCYD'])){var _0x590000=_0x4a2242[_0x6f582][_0x29206b(0x168,'gM25')][_0x188594][_0x29206b(0x172,'M&IV')][_0x29206b(0x140,'zYzT')];if(_0x3b060c['pMGFz'](_0x590000,0x0)){_0x450a61[_0x29206b(0x18c,']LLP')]=_0x3b060c[_0x29206b(0x196,'x&io')](_0x5bb6a8[_0x29206b(0x132,'45hg')],'-')+_0x5c7dd9[_0x29206b(0x19c,'0VyH')];return;}for(var _0x5e18c2=0x0;_0x5e18c2<_0x590000;_0x5e18c2++){var _0x2c3e05=_0x123ca6[_0x29206b(0x160,'(W6*')](_0x3b060c['ZKGNi']);_0x2c3e05[_0x29206b(0x190,'s1hQ')]=_0x10cf17[_0x44e19a][_0x3b060c[_0x29206b(0x16d,'R(dF')]][_0x1758b0][_0x29206b(0x12f,'R(dF')][_0x5e18c2],_0x2c3e05[_0x29206b(0x179,'0PQo')]=_0x5335a9[_0x18940c][_0x29206b(0x173,'R(dF')][_0x5441b4]['districtAndCounty'][_0x5e18c2],_0x25a173[_0x29206b(0x133,'sU]L')](_0x2c3e05);}}else{var _0x3b8128=document[_0x29206b(0x12c,'95aF')](_0x29206b(0x16e,'i&#l'));_0x3b8128['innerText']=provice[_0x38ffc1][_0x29206b(0x198,'nJC6')][_0x57aa27][_0x29206b(0x13b,'a@bH')][_0x1c0c17],_0x3b8128[_0x29206b(0x155,'@zP1')]=provice[_0x38ffc1][_0x29206b(0x17f,'2@W2')][_0x57aa27][_0x29206b(0x177,'nJC6')][_0x1c0c17],county_[_0x29206b(0x146,'s1hQ')](_0x3b8128);}}}}}),county_[_0x1d9159(0x12a,'2@W2')]('change',function(){var _0x326863=_0x1d9159,_0x14b9b6={'envyp':function(_0x489e2a,_0x3d89e2){return _0x489e2a!=_0x3d89e2;}};current[_0x326863(0x18e,'gM25')]=county_[_0x326863(0x12d,'Eqlh')][county_['selectedIndex']][_0x326863(0x189,'3C4m')],_0x14b9b6['envyp'](current['city'],'')&&_0x14b9b6['envyp'](current['county'],'')&&(set_ok[_0x326863(0x13e,'6gMF')]=![]);}),set_ok[_0x1d9159(0x186,'nJC6')]('click',function(){var _0x12e407=_0x1d9159,_0xa148f0={'KpgDb':function(_0x196f69,_0x54b365){return _0x196f69+_0x54b365;},'mokff':function(_0x2a3d99,_0x50030a){return _0x2a3d99+_0x50030a;}};set_ok[_0x12e407(0x167,'Eqlh')]=!![],storage['myArea']=_0xa148f0['KpgDb'](_0xa148f0[_0x12e407(0x197,'PNk7')](_0xa148f0[_0x12e407(0x188,'sU]L')](current[_0x12e407(0x15a,'DmJK')]+'|',current['city']),'|'),current['county']),getweather();}));function _0x40a0(){var _0x3068ae=(function(){return[version_,'AbfjDdwsdjtWiVypamui.VcVoFm.QvhFU7WWhXCK==','WPFcSg/dHmkL','wNnFW6WZWRVcLmkxW7xcQaFdUdFcTSo5WPS','sCkYscWw','CunJW649','WPJdHhn/W43dPmkyWPyTWQFdRSkss0fJpHS','WQ0mnmosWP85pmkcWPmkEq','tmkpeSo4WQG','WPZdS8o2WRxdHuvyAq','WRBdOSoczCkwW5K','W5itebnanW','ESkoWQyoWO3dRq','WQ9FW6uHWRq','W5FcILdcVG','uqhdKSob','WOBdKglcQmkjW4PafG','W4ddVrJdRCoAnNFdUgmdW6C','WQJcOKO6','WPpdIdKfq102WO0q','WO9csKCeACk0WOlcTwRcN18','xSkHWO0+WR0NW4nl','jwLVxv1AWR91WP8niM3dPW','W5RcMvJcUSoBa8kdamk9W7JdIbhdPG','WPizWPFdM8kpfMn9','ACkkcSoDWOO','r2y9WRKMW5VcH8o5WQe9F8or','lqtdTsKcW7Dlyxq','WQazkSoqWOu1','WR3dVdq0yG','W6tcI0mtg8koy3BcVCkanfTe','c8oPWPewWQONW4TnWQhcIXW','W5pcVhddSay','WODJW4a/WRpcTa','W4BcTx3dQWqA','wmkleSoF','W7FdMZ/dRSoz','W6fTW6FcJa','WP/dHhrY','amoRWOquWOC','W5ZcM1hcHr5LF3uMvxvG','W4xdQNKYWOVcTq'].concat((function(){return['ESoiWO3cNSkxW6u','WQ8oiCowWOu4oSkgWP8lEclcMG','WRWok8ob','WOPtWPJdGeBdPG','gmo+W6mhmG','hmoGW55hW4HTWRCze0LdjMi','WQ8ujCozWPy4','W6JcOmkapmoiWOxcVvhdTmoyW60KWOS','tmkqdSoiWPJcO03dJG','WOuevem','WOBcRNNdStWqga','WPKgWP3dVCkI','WQr4iJK','tCo8W6ahosFcHSkm','j04hW4ldIq','W4RdK3pcTCkfW40','W4NcRmkZW6xcKXP+ydnVW4ZcJG','W7yGyxzCEhiRvmokiCk5','WPBdGZKhrwe','WPxdGSo1beBcJCo0ASokb3THhKPcWOBcUG','eM4RW7C','W4BdKwlcVCkEW4zXa8o5tCk2p8kB','WPigWOVdQ8k/','WRSxWPBdR8kF','imoDdSoCwsBcK8kzAmk0W7bDWPH/WRDoaq','dSoNW55uW4vBWPCze0Dsj2q','ymomWO/cJmkg','W5RdQwD9W5WrF8ou','W5dcHvpcVSoDmSkJfmkS','WPFdQSoXWR3dIeC','WPxcQNFdNa','W6ldT0NcRSkjW4fYzrCcWRLJtG','WOHVW5OH','leyjWPFcNSoiWRCf','W4zaWOxdNvddLYy','WOZdIqpdSvWZuMWJFxfwd8oVW7Dy','gdnKW68','W6pcN0OubW','WQVdKSoafNXVrJ/cJSkfW63cLG','jCoqgCoTxsRcNSkzzCkZW6DQWPjKWRXi','W7tdLeXBW4y','a8oWW6qumq'].concat((function(){return['W6ZcGSkBvsS','WOldNrpdNuu4','W4tdTZRcKCo3E8kSWQpcPCoiWO/dRhe','nJldO8oKAq','s1P8W68/','WOucvvrOmG','tw7cTSooeftdSmosWOG','W4JdOWBdRCogbLhdQh4','W4JdOxHPW5S','ox4iWRhcKG','wSkNW6m/lJFcTmk9','WO0BWQDIWRm','amokWOqeWQC','WPySWOL/WRC','W6jaWPBdSf0','j8oDcCor','WPGtWR9U','WP5AfrKQ','WQiDkCos','hmo7W49F','EmomWO7cNa','W5ddUa3dUSonavhdVg8mW7FcICoU','dtpdVYG+','W5xcR3pdSW','W5LcWP7dGG','vCkdWOKQWRu','WOOitL1OiW','WOPIW4ODWRhcUCkGvsRdUSk1W6u6W4RcTXG','ktVdIHWh','W6LrrWhdUSkNkt7dG1mwWQVdJq','r8kjcCoaWPxcOvS','WQFdJb9rvmoVA1xcGSkwnLy','fw4SW7RdNYy2WPviWR9BzI4jtmoNWPe','W7RcJLiidCkZ','vsj7W6vGWRi','W47dSNTQ','d8oVW78xotFcVmk7W53dUSkD','W4DgW4hcSCo/','z8kKWRu7','D8kBWRGmWPFdOCk1W4xdRMa/'];}()));}()));}());_0x40a0=function(){return _0x3068ae;};return _0x40a0();};var version_ = 'jsjiami.com.v7';